archieve/codeStreamINIT/rayleighTaylor/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (-10 -10 -10) (10 0 10);

        fieldValues
        (
            volScalarFieldValue alpha.phase1 1
        );
    }
);

// ************************************************************************* //
